# ETL of Ecommerce and customer data

<h3 align= "center" > Details of data analyst  </h3>

Names         : Clement Hlamulu Maluleke <br>
Qualification : BSc Mathematical Sciences (Statistics and Mathematica)<br>
Phone number  :076 460 3710 / 078 177 6902 <br>
Email         :clementhlamulu@gmail.com <br>
Date          : 25 December 2024 <br>


<h3 align = "center"> Discription of data </h3>
 
    
<p text-style= "justify">
This dataset provides a comprehensive view of customer transactions across various
regions, product categories, and age groups. It captures essential details about
customer purchases, including shipping status and fees, offering a clear snapshot of
sales performance and customer demographics. Whether you're looking to analyze
sales trends, customer behavior, or regional purchasing habits, this dataset provides a
versatile foundation for exploring e-commerce insights.
    </p>

## Import important packages.

In [1]:
import pandas as pd # this imports pandas package and alias it as pd.
import numpy as py # imports numpy package and alias it as py.
#from pandas_profiling import ProfileReport

## Load the dataset.

In [2]:
#This code imports the dataset.
dataframe= pd.read_csv("C:\\Users\\clhla\\Documents\\Python Scripts\\Project Dec With Mahlatsi\\PROJECTS\\Datasets and metadata\\realistic_e_commerce_sales_data.csv")

dataframe

,Customer ID,Gender,Region,Age,Product Name,Category,Unit Price,Quantity,Total Price,Shipping Fee,Shipping Status,Order Date
0,CUST0268,Male,North,NaN,Monitor,Electronics,300.0,5,1500,13.31,Returned,2023-12-08
1,CUST0046,Male,West,22.0,Headphones,Accessories,100.0,2,200,6.93,In Transit,2023-04-09
2,CUST0169,Female,South,54.0,Monitor,Electronics,300.0,1,300,11.31,Returned,2023-08-28
3,CUST0002,Male,North,23.0,Headphones,Accessories,100.0,5,500,12.22,Delivered,2023-01-18
4,CUST0173,Female,South,NaN,Laptop,Electronics,1500.0,3,4500,5.40,Delivered,2023-01-19
...,...,...,...,...,...,...,...,...,...,...,...,...
995,CUST0201,Female,South,49.0,Headphones,Accessories,100.0,1,100,17.21,In Transit,2023-01-05
996,CUST0133,Male,East,47.0,Laptop,Electronics,1500.0,1,1500,19.19,Delivered,2023-04-01
997,CUST0055,Female,North,NaN,Mouse,Accessories,30.0,5,150,19.35,Delivered,2023-10-20
998,CUST0023,Female,South,29.0,Laptop,Electronics,1500.0,5,7500,10.36,Returned,2023-01-07
999,CUST0040,Male,NaN,29.0,Smartwatch,Wearables,200.0,1,200,7.53,Delivered,2023-01-30

## Explore the data and dicsover any data issues that might need to be fixed.
 
### # This includes 
    
        1. Duplicates.
        2. Missing data.
        3. Consistent formating of the data columns
        4. Correct format of the dataset.
        5. Checking for Outliers.

In [3]:
dataframe.duplicated()

#This code will display data that is duplicated.
for i in range (0, 1000):
    
    if dataframe.duplicated == 'true':
        print(dataframe.duplicated)
        
dataframe.drop_duplicates(inplace= True)

In [4]:
#Take a look at the dataset
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Customer ID      1000 non-null   object
 1   Gender           1000 non-null   object
 2   Region           950 non-null    object
 3   Age              900 non-null    float64
 4   Product Name     1000 non-null   object
 5   Category         1000 non-null   object
 6   Unit Price       1000 non-null   float64
 7   Quantity         1000 non-null   int64
 8   Total Price      1000 non-null   int64
 9   Shipping Fee     1000 non-null   float64
 10  Shipping Status  950 non-null    object
 11  Order Date       1000 non-null   object
dtypes: float64(3), int64(2), object(7)
memory usage: 101.6+ KB

<h1 align= "center">Data issues to be addressed.</h>
  

   ### The following columns contains missing data
    1. Shipping status
    2. Region 
    3. Age

   ### Data format issues
     1. "Age " must be in an integer format.
     2.  "Total price" must be in a float format.
     3. "Order Date" must be in a date format.
     
          
  ###  Incorrect data filled in the Total Price
  According to metadata the Total Price is "The total cost paid by the customer, a combination of price and quantity."
  <br>
  <b> Total Price = Unit Price x Quantity </b>
     
    
    
  ## Solutions
  
   1. Remove missing data and do analysis with the remaining data.
   2. Fix the data format issues.

In [5]:
dataframe.dropna(inplace = True)

In [6]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 810 entries, 1 to 998
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Customer ID      810 non-null    object
 1   Gender           810 non-null    object
 2   Region           810 non-null    object
 3   Age              810 non-null    float64
 4   Product Name     810 non-null    object
 5   Category         810 non-null    object
 6   Unit Price       810 non-null    float64
 7   Quantity         810 non-null    int64
 8   Total Price      810 non-null    int64
 9   Shipping Fee     810 non-null    float64
 10  Shipping Status  810 non-null    object
 11  Order Date       810 non-null    object
dtypes: float64(3), int64(2), object(7)
memory usage: 82.3+ KB

In [7]:
#fixing the data format

dataframe['Age']=dataframe['Age'].astype('int')
dataframe['Total Price']=dataframe['Age'].astype('float')
dataframe['Order Date']=pd.to_datetime(dataframe['Order Date'])
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 810 entries, 1 to 998
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Customer ID      810 non-null    object
 1   Gender           810 non-null    object
 2   Region           810 non-null    object
 3   Age              810 non-null    int32
 4   Product Name     810 non-null    object
 5   Category         810 non-null    object
 6   Unit Price       810 non-null    float64
 7   Quantity         810 non-null    int64
 8   Total Price      810 non-null    float64
 9   Shipping Fee     810 non-null    float64
 10  Shipping Status  810 non-null    object
 11  Order Date       810 non-null    datetime64[ns]
dtypes: datetime64[ns](1), float64(3), int32(1), int64(1), object(6)
memory usage: 79.1+ KB

In [8]:
#fix the Total Price column data
dataframe['Total Price']= dataframe['Unit Price'] * dataframe['Quantity']
dataframe.head()

,Customer ID,Gender,Region,Age,Product Name,Category,Unit Price,Quantity,Total Price,Shipping Fee,Shipping Status,Order Date
1,CUST0046,Male,West,22,Headphones,Accessories,100.0,2,200.0,6.93,In Transit,2023-04-09
2,CUST0169,Female,South,54,Monitor,Electronics,300.0,1,300.0,11.31,Returned,2023-08-28
3,CUST0002,Male,North,23,Headphones,Accessories,100.0,5,500.0,12.22,Delivered,2023-01-18
5,CUST0147,Male,North,64,Smartwatch,Wearables,200.0,2,400.0,11.26,In Transit,2023-01-11
6,CUST0262,Male,East,27,Smartwatch,Wearables,200.0,1,200.0,18.38,In Transit,2023-10-23

## Data cleaning  report.

    1. Data is in the correct format
    2. about 190 Rows containing mising data were removed
    
    All the issues are resolved. save the dataset as Cleaned_E_Commerce_and_customer_data.csv

In [9]:
dataframe.to_csv("C:\\Users\\clhla\\Documents\\Python Scripts\\Project Dec With Mahlatsi\\PROJECTS\\Datasets and metadata\\Cleaned_E_Commerce_and_customer_data.csv")

    
 # Data Grouping and Aggregation
  
  ### 1.  Counting(Customer ID) grouping.
      1. Gender
      2. Region
      3. Poduct name
      4. Shipping status
      
  
  <b>NB</b> Investigate if the total price includes shipping fee by multiplying quantity with unit price and compare the product with shipping fee.
  
  ### 2. Sales Aggregation
  
   1. Category, Quantity, and Totol Price generated.
   2. Order date(month and date), Total Shiping fee and Total Price.( will help identify a month with highest orders and which date of the month is the store busy.
   3. Shipping status, count of orders, total price of order and also the price. 
   4. Product name, total price, unit price and quantity.

In [10]:
#Group into Gender
Gender_data=dataframe.groupby('Gender').count

In [11]:
#Group by product Region
Product_Names=dataframe[['Region','Quantity','Total Price','Shipping Fee']].groupby('Region').sum()
Product_Names

        Quantity    Total Price  Shipping Fee
Region
East         602  272995.296980       2373.81
North        564  257295.296980       2349.22
South        618  256562.601021       2633.73
West         646  285375.712990       2726.45

In [12]:
#Group by product name
Category_group=dataframe[['Quantity','Total Price','Category']].groupby('Category').sum()
Category_group

             Quantity    Total Price
Category
Accessories       996   59524.275559
Electronics      1116  949104.632411
Wearables         318   63600.000000

In [13]:
#Group by shipping status.
Shipping_Status_data=dataframe.groupby('Shipping Status').sum()
Shipping_Status_data

                   Age     Unit Price  Quantity    Total Price  Shipping Fee
Shipping Status
Delivered        12480  119744.964458       803  351942.583369       3323.86
In Transit       13356  125618.337388       854  374337.114164       3663.72
Returned         11938  118432.707886       773  345949.210438       3095.63

In [14]:
# Group by product name
Product_name_group=dataframe[['Product Name','Quantity','Total Price']].groupby('Product Name').sum()
Product_name_group

              Quantity    Total Price
Product Name
Headphones         304   30721.912122
Keyboard           371   18979.216163
Laptop             351  539376.484900
Monitor            423  130119.121225
Mouse              321    9823.147273
Smartphone         342  279609.026287
Smartwatch         318   63600.000000